from telethon import events
import asyncio
import os
import sys
import random
from userbot.utils import admin_cmd

@borg.on(admin_cmd(pattern=r"foryou$", outgoing=True))
async def _(event):
    if event.fwd_from:
        return
    await event.edit("For you❤️...")
    await asyncio.sleep(2)
    x=(random.randrange(1,33))
    if x==1:

        await event.edit("💑ആത്മാർത്ഥ കൂടുതൽ എവിടെ കാട്ടിയോ അവിടെ നിന്നായിരിക്കും ഏറ്റവും കൂടുതൽ അവഗണന💔🚶🚶")

    if x==2:

        await event.edit("നെഞ്ചിൽ ഒരു നീറ്റൽ അവശേഷിപ്പിക്കാതെ ഒരു പ്രണയവും ഇറങ്ങി പോകുന്നില്ല... അങ്ങനെ അല്ലെങ്കിൽ അത് പ്രണയവും അല്ല💘💘!")

    if x==3:

        await event.edit("ചില ഇഷ്ട്ടങ്ങൾ ഉണ്ട്, ഇഷ്ട്ടപെടരുതെന്നു അറിഞ്ഞിട്ടും ഇഷ്ട്ട പെട്ടു പോയതാണ😇😇💞്...")

    if x==4:

        await event.edit("സ്വന്തമെന്നു കരുതി അഹങ്കരിക്കുന്ന നിയഴലും സൂര്യന്റെ ഔദാര്യമാണ്.😅😅")

    if x==5:

        await event.edit("നിന്നോട് വഴക്കിടാൻ എനിക്ക് ഇഷ്ട്ടമായിരുന്നു, അപ്പോഴെല്ലാം നിന്നോടുള്ള സ്നേഹം കൂടി വന്നു... എന്നിട്ടും നീ എന്തെ എന്നെ മനസിലാകാതെ പോയെ😪😪😪....????")

    if x==6:

        await event.edit("പൊന്നിട്ട് മൂടും എന്ന് പറയുന്നില്ല.... എന്നാൽ മണ്ണിട്ട് മൂടും വരെ കൂടെ ഉണ്ടാവും..😍😍.")

    if x==7:

        await event.edit("കൊണ്ട് പോകുവാൻ ഒന്നുമില്ല ഈ ലോകത്ത്... കൊടുത്ത് പോവാൻ സ്നേഹവും സൗഹൃദവും മാത്രം😉😉🙃.")    

    if x==8:

        await event.edit("നിന്നിൽ ഞാൻ ഇനിയും പെയ്യും.. നിന്നെ നനച്ചു.. നിന്റെ ആത്മാവിനെ നെഞ്ചോടു ചേർക്കും.. ഒടുവിൽ ഞമ്മൾ ഒരു മഴയായി തീരും, ഒരുമിച്ച് പെയ്യും.❣️❣️💓💕")

    if x==9:

        await event.edit("കാലം എന്നെ നിനക്ക് മുന്നിൽ എത്തിച്ചു എങ്കിൽ, എന്റെ മരണം വരെ ഞാൻ നിന്റെ കൂടെ ഉണ്ടാവും നീയായി എന്നെ വെറുത്തില്ലെങ്കിൽ മാത്രം💘💘")

    if x==10:

        await event.edit("എന്റെ പ്രണയം അസ്തമിക്കുകയില്ല..🌅. എന്റെ ഓർമകളുടെ ചെരുവിലെ സ്വപ്നങ്ങളും നിറങ്ങളും ഞാനും മായും വരെ..✨️✨️.")
     
    if x==11:

        await event.edit("എന്റെ ജീവിതം തുടങ്ങിയത് നിന്നോടൊപ്പം അല്ല പക്ഷെ എനിക്ക് ഉറപ്പുണ്ട് എന്റെ ജീവിതത്തിനു ഒരു അവസാനം ഉണ്ടെങ്കിൽ അത് നിന്നോട് ഒപ്പം ആയിരിക്കും, ആ അവസാന നിമിഷം വരെ ഞാൻ ഉണ്ടാവും നിന്റെ കൂടെ.💑💑..")

    if x==12:

        await event.edit("നീണ്ട കാത്തിരിപ്പിന് ഞാൻ തയാറാണ് കാലമേ.. മറ്റൊരു ഹൃദയം പകരം തന്ന് തൃപ്തി പെടുത്തരുത്.. നീണ്ട മുടിയിഴകൾ വെള്ളനൂൽ ആയി മാറിയേക്കാം.. നനുത്ത വിരലുകൾ വരണ്ടു ചുളുങ്ങിയേക്കാം.. മിഴികൾ അന്ധത കൂട്ട് പിടിച്ചേക്കാം.. അപ്പോഴും എന്റെ ഹൃദയം ആ ഓർമകളിൽ ചുവന്നു താനെയിരിക്കും.. അത് കൊണ്ട് നീ എനിക്കായി എന്തെകിലും തരാൻ ബാക്കി വച്ചിട്ടുണ്ടെങ്കിൽ അവളെ തന്നെ തരിക.. എന്റെ പ്രണയത്തെ..👫👫💝")
    
    if x==13:

        await event.edit("സ്നേഹിക്കണം, ചതിക്കുന്നവരെയല്ല അവഗണിക്കുന്നവരെയും അല്ല, ചങ്ക് പറിച്ചു തരുന്നവരെ ഞമ്മുടെ കണ്ണ് നിറഞ്ഞാൽ ഉള്ളു പിടയുന്നവരെ.💘💘.")

    if x==14:

        await event.edit("കാണാൻ കൊതിക്കുന്ന മുഖവും.. കേൾക്കാൻ കൊതിക്കുന്ന ശബ്ദവും ഒരുപാട് അകലെ ആയിരിക്കുമ്പോൾ, സ്നേഹം ഒരു നൊമ്പരം മാത്രമാണ്.💔💔💔.")
        
    if x==15:

        await event.edit("തിരക്ക് ഇല്ലങ്കിലും ചിലർ തിരക്കിൽ ആയിരിക്കും, എങ്ങനെ എങ്കിലും ഞമ്മുടെ മുന്നിൽ നിന്നും ഒഴിഞ്ഞു മാറി നിൽക്കാൻ.😣😣😣😖.")

    if x==16:

        await event.edit("ജീവിതത്തിന്റെ ഇരുൾ അടഞ്ഞ വഴികളിലൂടെ ഒറ്റയ്ക്കു നടക്കുമ്പോൾ ചേർത്ത് പിടിക്കാൻ കിട്ടുന്ന കൈകളുടെ കരുത്ത് നോക്കാറില്ല ആരും.🤝🤝👫👬👭.")
     
    if x==17:

        await event.edit("ഒരു പെൺകുട്ടി ആത്മാർഥമായി നിങ്ങളെ പ്രണയിക്കുന്നുണ്ടെങ്കിൽ.. അവൾ നിങ്ങളോട് ഒരുപാട് കാര്യങ്ങൾക് ദേഷ്യപ്പെടും💑❣️..")

    if x==18:

        await event.edit("നടക്കില്ല നടക്കില്ല എന്ന് വിചാരിച്ചാൽ ലോകത്ത് ഒരു കാര്യാവും നടക്കില്ല.. എന്നാൽ നടക്കും നടക്കും എന്ന് വിചാരിച്ചിട്ടിറങ്ങിയാൽ നടക്കാതെ കാര്യവും ഇല്ലാ 😅😇..")

    if x==19:

        await event.edit("മനസ് വിതുമ്പുന്ന സമയത്തും ചിരിക്കാൻ കഴിയുന്നത് ഭാഗ്യമാണ്, ഒരു വരദാനമാണ്.☺️☺️.. ഒന്നും ഇല്ലാത്തവർക്ക് ദൈവത്തിന്റെ സമ്മാനമാണ് അങ്ങനെ ചിരിക്കാൻ ഉള്ള കഴിവ്.☺️☺️😇.")

    if x==20:

        await event.edit("കൈ തട്ടി ഫോണിലോട്ടു നോക്കിയപ്പോൾ ഒരു മൊഞ്ചുള്ള മുഖം, അപ്പൊ മനസിലായി കൈ തട്ടി ഫ്രണ്ട് ക്യാമറ ഓൺ ആയതാണെന്നു..🙈🙈🙈")

    if x==21:
        
        await event.edit("ജീവിതത്തിൽ ആരെയും വിലകുറച്ചു കാണരുത്. ഓർക്കുക, നിലച്ചു പോയ ഘടികാരവും ദിവസത്തിൽ രണ്ടു പ്രാവിശ്യം യഥാർത്ഥ സമയം കാണിച്ച് തരുന്നു.⌚️⌚️. ")
        
    if x==22:
        
        await event.edit("ആരെയും പരിഹസിക്കരുത് സ്വന്തം സുഹൃത്തായാൽപോലും.. ന്യൂനതകൾ ഇല്ലാത്ത മനുഷ്യർ ഇല്ല.. എല്ലാം തികഞ്ഞവരായി മനുഷ്യനെ സൃഷ്ടിച്ചിട്ടുമില്ല..💞☺️")
       
    if x==23:

        await event.edit("നിന്നെ പരിചയപെട്ടപ്പോഴോ.. നിന്നോട് സംസാരിച്ചു തുടങ്ങിയപ്പോഴോ ഞാൻ അറിഞ്ഞില്ല.. നീയെന്റെ ഹൃദയത്തിലോട്ട് ഒരു ടിക്കറ്റ് എടുക്കുമെന്ന് ഈ ടിക്കറ്റ് വച്ച് അടുത്ത സ്റ്റോപ്പിൽ ആണോ.. അതോ അവസാന സ്റ്റോപ്പിൽ ഇറങ്ങുക, അത് വ്യക്തമല്ല.. എന്നാലും ഞാൻ നിന്നെ ഒരുപാട് സ്നേഹിക്കുന്നു..😇💓💖")

    if x==24:

        await event.edit("എന്റെ സ്വപ്നങ്ങളിൽ നിറയുന്നത് നിന്റെ മുഖം മാത്രം.. നീ എനിക്ക് എന്ത്ര പ്രിയ പെട്ടതാണെന്ന് പറയാൻ എനിക്ക് വാക്കുകൾ ഇല്ല.. എന്ത്ര കാലം വേണമെങ്കിലും കാത്തിരിക്കാം ഞാൻ.. നീ എന്റേത്‌ മാത്രമാവുന്ന നിമിഷത്തിനായി💘💘..")

    if x==25:
        
        await event.edit("ഓരോ യാത്രയിലും അറിയാതെ നിന്നെ തിരയുന്നു ഞാൻ.. കൈവിട്ടു പോയ നിന്റെ കൈകളെ.. നിന്റെ ഓർമകളെ.💔☹️☹️😢.")
        
    if x==26:
        
        await event.edit("നിന്റെ ഇഷ്ട്ടങ്ങൾ തേടി എന്റെ ഇഷ്ടങ്ങൾ എല്ലാം നീയായി.❤️❤️..")
        
    if x==27:
        
        await event.edit("ആകാശത്തിലെ നക്ഷത്രങ്ങളെയും, കടൽ തീരത്തെ മണൽ തരികളെയും എന്ന് ഞാൻ എണ്ണി തീർക്കുന്നോ അന്ന് ഞാൻ നിന്നെ മറക്കും.💘💘❤️❤️..")
        
    if x==28:
        
        await event.edit("മറക്കാൻ വയ്യ എന്ന് പറഞ്ഞ പലർക്കും ഇപ്പോൾ ഞമ്മളെ ഓർക്കാൻ വയ്യ എന്നാ അവസ്ഥയിലായി😊😊😊...")

    if x==29:
        
        await event.edit("ചിലർക്ക് ഞമ്മളാണ് ഏറ്റവും പ്രിയപ്പെട്ടത് എന്ന് കരുതുന്നുവെങ്കിലും...... അവർക്ക് പ്രിയം ഞമ്മളെ കാൾ മറ്റുള്ളവരോടാണ്, എന്നാ തിരിച്ചറിവ്.... വല്ലാത്ത നൊമ്പരം തന്നെയാണ്................ എന്നും.......... എപ്പോഴും 😊😊😭😭.......")
        
    if x==30:
        
        await event.edit("ഒരു പ്രണയം ഉണ്ടായിരുന്നു അത് ഞാൻ പഠിക്കാതെ എഴുതിയ പരീക്ഷ പോലെ തോറ്റു പോയി. കുറച്ച് ഓർമ്മകൾ ഉണ്ടായിരുന്നു അത് ഞാൻ ദൂരെ കടലിൽ ഒഴുകി കളഞ്ഞിട്ടും വീണ്ടും മഴയായി അത് എന്റെ മേൽ പെയ്യുന്നു. പിന്നെ ഉള്ളത് അല്പം വേദനയാണ്, അത് അണയാതെ, കളയാതെ ഒരു കനലായി നോവായി മനസ്സിൽ ഇപ്പോഴും കൊണ്ട് നടക്കുന്നു.🚶‍♂️🚶‍♂️.")
    
    if x==31:
        
        await event.edit("ദിവസവും ഒരുപാട് പെൺകുട്ടികളെ കാണാറുണ്ട്, അവരോട് ആരോടും ഇത് വരെ ഒരു ഇഷ്ട്ടം തോന്നിട്ടില്ല. കാരണം, എന്റെ പെണ്ണിന് എന്നിലൊരു വിശ്വാസമുണ്ട്. അത് തകർക്കാൻ എനിക്ക് ഈ ജന്മം കഴിയില്ല❤️❤️💘..")
        
    if x==32:
        
        await event.edit("സ്നേഹം... അത് കൈകുമ്പിളിൽ കോരി എടുക്കാനോ തട്ടി എടുക്കാനോ കഴിയില്ല, അത് ഹൃദയത്തിൽ നിന്നും ഹൃദയത്തിലേക്കു പകർന്നു നൽകുവാനേ കഴിയു.❤️❤️😇.")

    if x==33:
        
        await event.edit("എന്റെ ഹൃദയത്തിൽ ചുവന്ന റോസാപുഷ്പ്പങ്ങൾ വളരുന്നുണ്ട്. പക്ഷെ, അവ ഒരിക്കലും കൊഴിയാറില്ല. കാരണം, ഞാൻ നിന്റെ പുഞ്ചിരി കാണുമ്പോഴും നിന്നെ കുറിച്ച് ചിന്തിക്കുമ്പോഴുമെല്ലാം അവ വിടരുന്നു☺️☺️..")
